# Second Highest Salary Problem

This notebook demonstrates how to find the second highest salary from an Employee table using SQL queries. We'll implement different approaches and test various scenarios.

## Problem Description
Write a SQL query to get the second highest salary from the Employee table.

### Sample Data
```
Table: Employee
| Id | Name    | Salary |
|----|---------|--------|
| 1  | Alice   | 100    |
| 2  | Bob     | 200    |
| 3  | Charlie | 300    |
```

### Expected Output
```
| SecondHighestSalary |
|---------------------|
| 200                 |
```

Note: If there is no second highest salary, the result should be null.

## 1. Import Required Libraries

In [33]:
import sqlite3
import pandas as pd
import unittest
from IPython.display import display, HTML

## 2. Set up SQLite Database and Create Employee Table

In [34]:
# Create an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Create Employee table
cursor.execute('''
CREATE TABLE Employee (
    Id INTEGER PRIMARY KEY,
    Name TEXT,
    Salary INTEGER
)
''')

## 3. Populate Employee Table with Sample Data

In [35]:
# Insert sample data
cursor.executemany('INSERT INTO Employee (Id, Name, Salary) VALUES (?, ?, ?)',
                  [(1, 'Alice', 100),
                   (2, 'Bob', 200),
                   (3, 'Charlie', 300)])
conn.commit()

# Display the table using pandas
query = "SELECT * FROM Employee"
df = pd.read_sql_query(query, conn)
display(df)

   Id     Name  Salary
0   1    Alice     100
1   2      Bob     200
2   3  Charlie     300

## 4. SQL Solution - Subquery Approach

In [36]:
# SQL query using subquery
subquery_sql = """
SELECT MAX(Salary)
FROM Employee
WHERE Salary < (SELECT MAX(Salary) FROM Employee);
"""

df_result = pd.read_sql_query(subquery_sql, conn)
display(df_result)

   MAX(Salary)
0          200

## 5. SQL Solution - LIMIT Approach

In [41]:
# SQL query using subquery
subquery_sql = """
SELECT Salary
FROM Employee
ORDER BY Salary DESC LIMIT 1 OFFSET 1
"""

df_result = pd.read_sql_query(subquery_sql, conn)
display(df_result)

   Salary
0     200